In [1]:
%load_ext sql

**Please Note**: Change username and password to your username and password

In [2]:
%sql postgresql://yussef:hatem@127.0.0.1/sparkifydb

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://yussef:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 24, 0, 45, 0, 796000), 26, 'free', None, None, 873, 'San Jose-Sunnyvale-Santa Clara, CA', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 24, 0, 51, 45, 796000), 26, 'free', None, None, 873, 'San Jose-Sunnyvale-Santa Clara, CA', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 24, 2, 30, 2, 796000), 87, 'free', None, None, 86, 'Myrtle Beach-Conway-North Myrtle Beach, SC-NC', 'Mozilla/5.0 (Windows NT 6.3; WOW64; Trident/7.0; rv:11.0) like Gecko'),
 (4, datetime.datetime(2018, 11, 24, 2, 48, 34, 796000), 88, 'paid', None, None, 888, 'Sacramento--Roseville--Arden-Arcade, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (5, datetime.datetime(2018, 11, 24, 2, 53, 10, 796000), 88, 'paid', None, None, 888, 'Sacramento--Roseville--Arden-Arcade, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"')]

This query will get results **if you run etl.py first**

In [4]:
%sql SELECT * FROM songplays WHERE song_id IS NOT NULL

 * postgresql://yussef:***@127.0.0.1/sparkifydb
1 rows affected.

[(5051, datetime.datetime(2018, 11, 21, 21, 56, 47, 796000), 15, 'paid', 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [5]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://yussef:***@127.0.0.1/sparkifydb
5 rows affected.

[(87, 'Dustin', 'Lee', 'M', 'free'),
 (68, 'Jordan', 'Rodriguez', 'F', 'free'),
 (23, 'Morris', 'Gilmore', 'M', 'free'),
 (92, 'Ryann', 'Smith', 'F', 'free'),
 (13, 'Ava', 'Robinson', 'F', 'free')]

In [6]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://yussef:***@127.0.0.1/sparkifydb
5 rows affected.

[('SODAUVL12A8C13D184', 'Prognosis', 'ARWB3G61187FB49404', 2000, 363.85914),
 ('SORRZGD12A6310DBC3', 'Harajuku Girls', 'ARVBRGZ1187FB4675A', 2004, 290.55955),
 ('SOLYIBD12A8C135045', 'Music is what we love', 'AR051KA1187B98B2FF', 0, 261.51138),
 ('SONSKXP12A8C13A2C9', 'Native Soul', 'AR0IAWL1187B9A96D0', 2003, 197.19791),
 ('SOFCHDR12AB01866EF', 'Living Hell', 'AREVWGE1187B9B890A', 0, 282.43546)]

In [7]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://yussef:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARWB3G61187FB49404', 'Steve Morse', 'Hamilton, Ohio', nan, nan),
 ('ARVBRGZ1187FB4675A', 'Gwen Stefani', '', nan, nan),
 ('AR051KA1187B98B2FF', 'Wilks', '', nan, nan),
 ('AR0IAWL1187B9A96D0', 'Danilo Perez', 'Panama', 8.4177, -80.11278),
 ('AREVWGE1187B9B890A', 'Bitter End', 'Noci (BA)', -13.442, -41.9952)]

In [8]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://yussef:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 24, 0, 45, 0, 796000), 0, 24, 47, 11, 2018, 5),
 (2, datetime.datetime(2018, 11, 24, 0, 51, 45, 796000), 0, 24, 47, 11, 2018, 5),
 (3, datetime.datetime(2018, 11, 24, 2, 30, 2, 796000), 2, 24, 47, 11, 2018, 5),
 (4, datetime.datetime(2018, 11, 24, 2, 48, 34, 796000), 2, 24, 47, 11, 2018, 5),
 (5, datetime.datetime(2018, 11, 24, 2, 53, 10, 796000), 2, 24, 47, 11, 2018, 5)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).